#include <stdio.h>
int main(){
    int a, b, c, d, e, f, g, h, i, k, l, m;
    printf("Шөлтэй хоол идэх үү?\n Тийм бол 1, Үгүй бол 0\n");
    scanf("%d", &a);
    if (a == 1)
    {
        printf("Цайтай бол 1, үгүй бол 2\n");
        scanf("%d", &b);
        if (b == 1)
        {
            printf("Будаатай бол 1, үгүй банштай бол 2\n");
            scanf("%d", &c);
            if (c == 1)
            {
                printf("Будаатай цай\n");
            }else{
                printf("Банштай цай\n");
            }
            
        } else if (b == 2){
            printf("Юутай шөл идмээр байна?\n Гурилтай бол 1, Пүнтүүзтэй бол 2, Гоймонтой бол 3, Банштай бол 4, Махтай бол 5, Ногоотой бол 6\n");
            scanf("%d",&d);
            if (d ==1)
            {
                printf("Лапша\n");
            } else if (d==2)
            {
                printf("Хууцай\n");
            }else if (d==3)
            {
                printf("Гоймонтой шөл\n");
            }else if (d==4)
            {
                printf("Банштай шөл\n");
            }else if (d==5)
            {
                printf("Хар шөл\n");
            } else{
                printf("Ногоотой шөл\n");
            }
        }else{
            printf("Буруу тоо оруулсан байна.\n");
        }
        
    } else if (a == 0) 
    {
        printf("Мах нь татсан уу?\n Тийм бол 1, Үгүй бол 2\n");
        scanf("%d", &e);
        if (e==1)
        {
            printf("Гуриланд ороосон уу?\n Тийм бол 1, Үгүй бол 2\n");
            scanf("%d", &f);
            if (f==1)
            {
                printf("Яаж болгосон?\n Шарсан бол 1, Жигнэсэн бол 2\n");
                scanf("%d", &g);
                if (g==1)
                {
                    printf("Яаж шарсан?\n Хөөлгөн шарсан бол 1, Шууд шарсан бол 2\n");
                    scanf("%d", &h);
                    if (h==1)
                    {
                        printf("Пирошки");
                    } else {
                        printf("Хуушуур");
                    }
                }
                else{
                    printf("Яаж жигнэсэн?\n Хөөлгөн жигнэсэн бол 1, Шууд жигнэсэн бол 2\n");
                    scanf("%d", &i);
                    if (i==1)
                    {
                        printf("Мантуун бууз\n");
                    } else {
                        printf("Бууз\n");
                    }
                }
            }else{
                printf("Будаатай юу?\n Өндгөнд ороосон бол 1, Махаа бөөрөнхийлсн бол 2\n");
                scanf("%d", &k);
                if (k==1)
                {
                    printf("Өндөгтэй пифштекс\n");
                } else {
                    printf("Тефтель\n");
                }
                
            }
        } else{
            printf("Юутай хольсон?\n Гурилтай бол 1, Өндөгтэй бол 2, Будаатай бол 3, Ногоотой бол 4\n");
            scanf("%d", &l);
            if (l==1){
                printf("Цуйван\n");
            } else if (l==2)
            {
                printf("Өндөгтэй хуурга\n");
            } else if (l==3)
            {
                printf("Хооронд нь холих уу?\n Тийм бол 1, Үгүй бол 2\n");
                scanf("%d", &m);
                if (m==1)
                {
                    printf("Гулиаш\n");
                }else{
                    printf("Будаатай хуурга\n");
                }
            } else{
                printf("Ногоотой хуурга\n");
            }
        }
    } else{
        printf("Буруу тоо оруулсан байна.\n");
    }
    
    
}